Рабочая.Задачи2/src/Catalogs/ЦБР_КолонкиАРМ/ЦБР_КолонкиАРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦБР_КолонкиАРМ</name>
  <owners>Catalog.ЦБР_ШаблоныАРМ</owners>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОтбора</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветHEX</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветRGB</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаRGB</name>
    <comment>Служебный</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Рабочая.Задачи2/src/Catalogs/ЦБР_КолонкиАРМ/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ОткрытьФормуВыбораЦвета(ИмяРеквизитаЦветаHEX, ИмяРеквизитаЦветаRGB = "", ИмяРеквизитаЦветаТекстаRGB = "")

	ОткрытьФорму("ОбщаяФорма.фвц_ФормаВыбораЦвета", 
		Новый Структура("Цвет", Объект[ИмяРеквизитаЦветаHEX]), 
		ЭтаФорма,,,, 
		Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыВыбораЦвета", ЭтаФорма, 
			Новый Структура("ИмяРеквизитаЦветаHEX, ИмяРеквизитаЦветаRGB, ИмяРеквизитаЦветаТекстаRGB", 
				ИмяРеквизитаЦветаHEX, ИмяРеквизитаЦветаRGB, ИмяРеквизитаЦветаТекстаRGB
			)
		)
	); 
	
КонецПроцедуры      

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормыВыбораЦвета(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ВыбранноеЗначение) ИЛИ ВыбранноеЗначение = КодВозвратаДиалога.Отмена Тогда
		Возврат;	
	КонецЕсли; 	
	
	//Модифицированность = Истина;      
	
	///////////////////////////// Цвет фона/текста в HEX	
	ИмяРеквизитаЦветаHEX 			= ДополнительныеПараметры.ИмяРеквизитаЦветаHEX;
	Объект[ИмяРеквизитаЦветаHEX] 	= ВыбранноеЗначение.ЦветHEX;         
	
	///////////////////////////// Цвет фона/текста в RGB (для фона элемента формы)
	
	ЦветФона = Новый Цвет(ВыбранноеЗначение.ЦветRGB.R, ВыбранноеЗначение.ЦветRGB.G, ВыбранноеЗначение.ЦветRGB.B);  
	
	Элементы.ВыборЦвета.ЦветФона = ЦветФона;
		                      
	МассивЧастейЦвета = Новый Массив;
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветRGB.R);
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветRGB.G);
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветRGB.B); 
	
	Объект[ДополнительныеПараметры.ИмяРеквизитаЦветаRGB] = СтрСоединить(МассивЧастейЦвета, ",");
	
	/////////////////////////////////// Служебный цвет в RGB (для цвета текста элемента формы, если фон темный - цвет будет белый, если светлный - черный) 
	
	МассивЧастейЦвета = Новый Массив;
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветТекстаRGB.R);
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветТекстаRGB.G);
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветТекстаRGB.B);  
	
	Объект[ДополнительныеПараметры.ИмяРеквизитаЦветаТекстаRGB] = СтрСоединить(МассивЧастейЦвета, ",");
	
	//Элементы[ИмяРеквизитаЦветаHEX].ЦветТекста = Новый Цвет(ВыбранноеЗначение.ЦветТекстаRGB.R, ВыбранноеЗначение.ЦветТекстаRGB.G, ВыбранноеЗначение.ЦветТекстаRGB.B);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ЭтоЗадание Тогда
		СхемаКомпоновки  = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетЗадания");
	Иначе 	
		СхемаКомпоновки  = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	КонецЕсли;
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СхемаКомпоновки, Новый УникальныйИдентификатор);
	ИсточникНастроек          = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилище);
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(ИсточникНастроек);
	
	Элементы.ВыборЦвета.ЦветФона 	= фвц_ВыборЦветаHTMLПовтИсп.ЦветПоСтрокеRGB(Объект.ЦветRGB);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	Если Объект.ЭтоЗадание Тогда
		СхемаКомпоновки  = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетЗадания");
	Иначе 	
		СхемаКомпоновки  = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	КонецЕсли; 
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СхемаКомпоновки, Новый УникальныйИдентификатор);
	ИсточникНастроек          = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилище);
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(ИсточникНастроек);
	

	Если Объект.Ссылка.Пустая() Тогда
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	Иначе     
		НастройкиОбора = ТекущийОбъект.УсловияОтбора.Получить();
		Если ЗначениеЗаполнено(НастройкиОбора) Тогда
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(НастройкиОбора);
		Иначе 
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
		КонецЕсли;
	КонецЕсли;      
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.УсловияОтбора = Новый ХранилищеЗначения(КомпоновщикНастроекКомпоновкиДанных.Настройки);

КонецПроцедуры

&НаКлиенте
Процедура ВыборЦвета(Команда) 
	
  	ОткрытьФормуВыбораЦвета("ЦветHEX", "ЦветRGB", "ЦветТекстаRGB"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоЗаданиеПриИзменении(Элемент)
	Если Объект.ЭтоЗадание Тогда
		СхемаКомпоновки  = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетЗадания");
	Иначе 	
		СхемаКомпоновки  = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	КонецЕсли; 
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СхемаКомпоновки, Новый УникальныйИдентификатор);
	ИсточникНастроек          = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилище);
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(ИсточникНастроек);
КонецПроцедуры
